[
  {
    "date": "2025-12-27",
    "title": "Ayarlar icin kaydet butonu belirginlestirildi",
    "summary": "SAFE MODE ve diger ayarlar icin ustte de Kaydet butonu var.",
    "details": [
      "SAFE MODE anahtari degisince ayarlar otomatik kaydedilir.",
      "Kayit basarisizsa ekranda hata mesaji gorunur."
    ]
  },
  {
    "date": "2025-12-27",
    "title": "Kontrol sayfasinda eksik roleler tamamlandi",
    "summary": "Tum roleler kontrol ekraninda gorunur hale getirildi.",
    "details": [
      "Eksik olan roleler otomatik olarak varsayilan listeden eklenir.",
      "Kontrol sayfasi her zaman 6 roleyi gosterir."
    ]
  },
  {
    "date": "2025-12-27",
    "title": "Grafik alt etiketleri siklastirildi",
    "summary": "Zaman etiketleri daha sik gorunerek grafikleri okumak kolaylasti.",
    "details": [
      "Genis ekranda daha fazla saat etiketi gosterilir.",
      "Mobilde kalabalik olmamasi icin etiket sayisi otomatik ayarlanir."
    ]
  },
  {
    "date": "2025-12-27",
    "title": "Olay gunlugunde pasif donanimlar gizlendi",
    "summary": "Disabled olan cikislar artik olay gunlugunde gorunmuyor.",
    "details": [
      "Donanim sayfasindan Aktif secenegi kapali olanlar listeden gizlenir.",
      "Gereksiz log kalabaligi azaldi."
    ]
  },
  {
    "date": "2025-12-27",
    "title": "Grafik alti saat etiketleri eklendi",
    "summary": "Grafiklerde alt kisimda zaman etiketleri gorunur hale geldi.",
    "details": [
      "Baslangic, orta ve bitis saatleri grafikte alt tarafta yer alir.",
      "Degerleri yorumlamak ve zaman araligini gormek kolaylasti."
    ]
  },
  {
    "date": "2025-12-27",
    "title": "LCD adresi 0x3F olarak ayarlandi",
    "summary": "20x4 I2C LCD modulin dogru adresle calismasi icin varsayilan adresi guncelledim.",
    "details": [
      "LCD ayarlari artik 0x3F adresine gore yukleniyor.",
      "Panelde gorunen LCD ayarlari moduline uygun hale geldi."
    ]
  },
  {
    "date": "2025-12-27",
    "title": "Güncellemeler sayfası eklendi",
    "summary": "Artık panelde yapılan değişiklikleri kullanıcı dilinde buradan takip edebilirsin.",
    "details": [
      "Her GitHub push sonrasında bu listeye kısa ve anlaşılır bir not eklenir.",
      "Teknik detay yerine sana etkisini ve faydasını anlatır."
    ]
  }
]
